{
  "backend/main.mo": "Defines data types and initial state for devotional content, journaling, fasting sessions, Bible references, reminders, and user data in a Motoko canister actor.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, and test IDs for high‑contrast theme and UI updates.",
  "frontend-file-summaries.txt": "Provides brief descriptions of key frontend files, summarizing their purpose and UI/theme characteristics.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app controller handling authentication, routing between pages, and global providers such as React Query and ThemeProvider.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright info, a heart icon, and a link to caffeine.ai with high‑contrast styling.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links, mobile sheet menu, and authentication controls using Internet Identity and React Query.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts new authenticated users to enter their name and saves the profile via a mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile, devotional days, journal entries, Bible verses, and bookmark operations using the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS styles defining themes, typography, animations, scrollbars, and transitions.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/BiblePage.tsx": "Bible reading and search page with book/chapter navigation, verse display, bookmarking, and search results.",
  "frontend/src/pages/DevotionPage.tsx": "Displays a daily devotion with navigation, journaling (including voice input), and saving journal entries linked to the selected day.",
  "frontend/src/pages/FastingPage.tsx": "Manages fasting sessions with goal setting, progress tracking, reflections, and optional voice input.",
  "frontend/src/pages/HomePage.tsx": "Shows the user's current devotional day, progress, and navigation options to continue devotions or open the Bible.",
  "frontend/src/pages/JournalPage.tsx": "Lists all journal entries with sorting and navigation to each day's devotion, plus a placeholder export feature.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen introducing the devotional app, highlighting features, and handling authentication before starting the journey.",
  "frontend/src/pages/MinistryPage.tsx": "Displays ministry information including mission, contact details, location, and a link to support the ministry.",
  "frontend/src/pages/MyJourneyPage.tsx": "Displays the user’s progress, recent journal entries, bookmark counts, and profile info, with loading states and navigation to specific days.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for enabling daily reminders, setting reminder time, handling notification permissions, and sending test notifications with localStorage persistence.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing stored values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, container settings, animations, and plugin usage for styling across the app.",
  "project_state.json": "Describes the project’s current feature set and roadmap, detailing authentication, role management, devotional content, journaling, and related system capabilities."
}